# AssetSetIterator Properties

---
The AssetSetIterator type exposes the following members.
| Name| Description
---|---|---
| Current|
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace